# ERD

 ![png](Data/bookscore.png)

# Import Libraries & create connection

In [1]:
import pandas as pd
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
# Create connection string using credentials following this format
# connection = "dialect+driver://username:password@host:port/database"
connection_str = "mysql+pymysql://root:Nina5056$@localhost/books_db"

In [2]:
engine = create_engine(connection_str)

In [3]:
# Check if the database exists. If not, create it.
if database_exists(connection_str) == False:
  create_database(connection_str)
else:
  print('The database already exists')

The database already exists

In [4]:
database_exists(connection_str)

True

# Load Data

In [5]:
# load in original dataset
df = pd.read_csv(r'C:\Users\Melissa\Documents/data (4).csv')
df.head()

,First Name,Last Name,Email,Book Title,Book Author
0,John,Doe,JD@books.com,The Shining,Stephen King
1,John,Doe,JD@books.com,It,Stephen King
2,John,Doe,JD@books.com,The Great Gatsby,F. Scott Fitzgerald
3,Robin,Smith,Robin@books.com,The Call of the Wild,Jack London
4,Robin,Smith,Robin@books.com,Pride and Prejudice,Jane Austen

In [6]:
#loading in the Users dataframe to pandas
users = pd.read_csv(r'C:\Users\Melissa\Data/users.csv')
users.head()

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [7]:
#adding the users data to the books database
users.to_sql('users', engine, if_exists = 'replace')

3

In [8]:
#loading in the books dataframe to pandas
books = pd.read_csv(r'C:\Users\Melissa\Data/books.csv')
books.head()

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [9]:
#adding the books data to the books database
books.to_sql('books', engine, if_exists = 'replace')

6

In [10]:
#loading in the authors dataframe to pandas
authors = pd.read_csv(r'C:\Users\Melissa\Data/authors.csv')
authors.head()

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [11]:
#adding the authors data to the books database
authors.to_sql('authors', engine, if_exists = 'replace')

5

In [12]:
#loading in the favorites dataframe to pandas
favorites = pd.read_csv(r'C:\Users\Melissa\Data/favorites.csv')
favorites.head()

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

In [13]:
#adding the favorites data to the books database
favorites.to_sql('favorites', engine, if_exists = 'replace')

7

# Select all authors

In [14]:
#confirming I can connect with the authors table using a query
q = """SELECT * FROM authors LIMIT 5;"""
pd.read_sql(q, engine)

   index  id        author_name
0      0   1       Stephen King
1      1   2  F.Scott Fitgerald
2      2   3        Jack London
3      3   4        Jane Austen
4      4   5       Mary Shelley

# Show Tables

In [15]:
#show all the tables in the books_db
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_books_db
0            authors
1              books
2          favorites
3              users

# John Doe's Favorite Books

In [16]:
#query that lists the titles of all of John Doe's favorite books
q2= """
SELECT books.title, favorites.user_id
FROM books
JOIN favorites ON books.id = favorites.book_id
WHERE favorites.user_id = 
    (SELECT users.id FROM users WHERE (users.last_name = "Doe" AND users.first_name = "John"));"""
pd.read_sql(q2, engine)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1